app/Http/Livewire/Exam07AnscrDistributionComp.php

select * from `myclasses` order by `name` asc
select * from `myclass_sections` order by `myclass_id` asc
select * from `myclasses` where `myclasses`.`id` in (1, 2, 3, 4, 5, 6, 7, 8)
select * from `sections` where `sections`.`id` in (1, 2)
select * from `subject_types` order by `name` asc
select * from `exam01_names` order by `name` asc
select * from `exam02_types` order by `name` asc
select * from `exam03_parts` order by `name` asc
select * from `schools` order by `name` asc
select * from `users` order by `name` asc
select * from `users` where `users`.`id` in (0, 7)
select * from `exam06_class_subjects`
select * from `myclasses` where `myclasses`.`id` in (1)
select * from `subjects` where `subjects`.`id` in (1, 6, 9, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24)
select * from `exam06_class_subjects` where `exam06_class_subjects`.`id` in (741, 742)
select * from `exam07_ansscr_dists`
select * from `myclass_sections` where `myclass_sections`.`id` in (1)
---
    public function loadData()
    {
        // Load classes as Eloquent Collection (objects)
        $this->classes = Myclass::orderBy('name')->get();
        $this->sections = MyclassSection::with(['section', 'myclass'])->orderBy('myclass_id')->get();
        $this->subjectTypes = SubjectType::orderBy('name')->get();
        $this->examNames = Exam01Name::orderBy('name')->get();
        $this->examTypes = Exam02Type::orderBy('name')->get();
        $this->examParts = Exam03Part::orderBy('name')->get();
        $this->sessions = Session::orderBy('name')->get();
        $this->schools = School::orderBy('name')->get();
        $this->users = User::orderBy('name')->get();
        $this->teachers = Teacher::with('user')->orderBy('id')->get();

        // Load existing answer script distributions
        $this->examClassSubjects = Exam06ClassSubject::with([
            'myclass',
            'subject',
            'examDetail.examName',
            'examDetail.examType',
            'examDetail.examPart',
            'examDetail.examMode'
        ])->get();

        // Load existing distributions
        $this->existingDistributions = Exam07AnsscrDist::with([
            'myclassSection.section',
            'examClassSubject.myclass',
            'examClassSubject.subject',
            'examClassSubject.examDetail',
            'teacher.user',
            'session'
        ])->get();

select * from `myclass_sections` where `myclass_id` = 1 order by `section_id` asc
---
    public function initializeFormData()
    {
        // Initialize form data structure with existing records
        foreach ($this->existingDistributions as $record) {
            $examClassSubject = $record->examClassSubject;
            if ($examClassSubject && $record->myclassSection) {
                $cellKey = $record->myclass_section_id . '_' . $examClassSubject->id . '_' . $examClassSubject->exam_detail_id;
                $this->formData[$cellKey] = [
                    'teacher_id' => $record->teacher_id,
                    'order_index' => $record->order_index,
                    'is_optional' => $record->is_optional,
                    'session_id' => $record->session_id,
                    'school_id' => $record->school_id,
                    'user_id' => $record->user_id,
                    'approved_by' => $record->approved_by,
                    'is_active' => $record->is_active,
                    'is_finalized' => $record->is_finalized,
                    'status' => $record->status,
                    'remarks' => $record->remarks
                ];

select * from `myclass_sections` where `myclass_id` = 1 order by `section_id` asc
select * from `sections` where `sections`.`id` in (1)
---
    public function getClassSections($classId)
    {
        return MyclassSection::where('myclass_id', $classId)
            ->with(['section'])
            ->orderBy('section_id')
            ->get();

select * from `subject_types` where `name` = 'Summative' limit 1
select * from `myclass_subjects` where `myclass_id` = 1 and exists (select * from `subjects` where `myclass_subjects`.`subject_id` = `subjects`.`id` and `subject_type_id` = 2) order by `subject_id` asc
select * from `myclasses` where `myclasses`.`id` in (1)
select * from `subjects` where `subjects`.`id` in (1, 6, 9, 13, 24)
---
    public function getSummativeSubjects($classId)
    {
        // Get Summative subject type (assuming ID 2 based on database)
        $summativeType = SubjectType::where('name', 'Summative')->first();

        if (!$summativeType) {
            return collect();
        }

        return MyclassSubject::where('myclass_id', $classId)
            ->whereHas('subject', function ($query) use ($summativeType) {
                $query->where('subject_type_id', $summativeType->id);
            })
            ->with(['subject', 'myclass'])
            ->orderBy('subject_id')
            ->get();

select * from `subject_types` where `name` = 'Formative' limit 1
select * from `myclass_subjects` where `myclass_id` = 1 and exists (select * from `subjects` where `myclass_subjects`.`subject_id` = `subjects`.`id` and `subject_type_id` = 1) order by `subject_id` asc
select * from `myclasses` where `myclasses`.`id` in (1)
select * from `subjects` where `subjects`.`id` in (15, 16, 17, 18, 19, 20, 21, 22, 23)
---
    public function getFormativeSubjects($classId)
    {
        // Get Formative subject type
        $formativeType = SubjectType::where('name', 'Formative')->first();

        if (!$formativeType) {
            return collect();
        }

        return MyclassSubject::where('myclass_id', $classId)
            ->whereHas('subject', function ($query) use ($formativeType) {
                $query->where('subject_type_id', $formativeType->id);
            })
            ->with(['subject', 'myclass'])
            ->orderBy('subject_id')
            ->get();

select * from `exam05_details` where `myclass_id` = 1 and exists (select * from `exam02_types` where `exam05_details`.`exam_type_id` = `exam02_types`.`id` and `name` like '%Summative%') order by `exam_name_id` asc, `exam_type_id` asc, `exam_part_id` asc
---
    public function getExamDetailsForClass($classId)
    {
        return Exam05Detail::where('myclass_id', $classId)
            ->with(['examName', 'examType', 'examPart', 'examMode'])
            ->orderBy('exam_name_id')
            ->orderBy('exam_type_id')
            ->orderBy('exam_part_id')
            ->get();

select * from `exam05_details` where `myclass_id` = 1 and exists (select * from `exam02_types` where `exam05_details`.`exam_type_id` = `exam02_types`.`id` and `name` like '%Summative%') order by `exam_name_id` asc, `exam_type_id` asc, `exam_part_id` asc
---
    public function getExamDetailsForClassAndSubjectType($classId, $subjectTypeName)
    {
        $query = Exam05Detail::where('myclass_id', $classId);

        if (strtolower($subjectTypeName) === 'summative') {
            $query->whereHas('examType', function ($q) {
                $q->where('name', 'like', '%Summative%');
            });
        } elseif (strtolower($subjectTypeName) === 'formative') {
            $query->whereHas('examType', function ($q) {
                $q->where('name', 'like', '%Formative%');
            });
        }

        return $query->with(['examName', 'examType', 'examPart', 'examMode'])
            ->orderBy('exam_name_id')
            ->orderBy('exam_type_id')
            ->orderBy('exam_part_id')
            ->get()
            ->groupBy('exam_name_id');

select * from `exam06_class_subjects` where `exam_detail_id` = 189 limit 1
---
    public function saveDistribution($myclassSectionId, $examDetailId)
    {
        Log::info('=== SAVE DISTRIBUTION DEBUG ===', [
            'myclassSectionId' => $myclassSectionId,
            'examDetailId' => $examDetailId,
            'full_formData' => $this->formData,
            'formData_keys' => array_keys($this->formData)
        ]);

        // Find the corresponding exam_class_subject_id
        $examClassSubject = Exam06ClassSubject::where('exam_detail_id', $examDetailId)->first();

select * from `exam07_ansscr_dists` where `myclass_section_id` = 1 and `exam_class_subject_id` = 742 limit 1
---

        try {
            // Check if record already exists for this specific combination
            $existingRecord = Exam07AnsscrDist::where('myclass_section_id', $myclassSectionId)
                ->where('exam_class_subject_id', $examClassSubjectId)
                ->first();

select * from `exam06_class_subjects` where `exam06_class_subjects`.`id` in (741, 742)
select * from `exam07_ansscr_dists`
select * from `myclass_sections` where `myclass_sections`.`id` in (1)
select * from `sections` where `sections`.`id` in (1)
---
            }

            // Refresh the existing distributions to show updated data
            $this->existingDistributions = Exam07AnsscrDist::with([
                'myclassSection.section',
                'examClassSubject',
                'teacher.user',
                'session'
            ])->get();

select * from `exam06_class_subjects` where `exam06_class_subjects`.`id` in (742)
select * from `myclass_subjects` where `myclass_id` = 1
select * from `myclasses` where `myclasses`.`id` in (1)
select * from `subjects` where `subjects`.`id` in (1, 6, 9, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24)
---
    public function getSubjects($classId)
    {
        return MyclassSubject::where('myclass_id', $classId)
            ->with(['subject', 'myclass'])
            ->get()
            ->sortByDesc(function ($subject) {
                return $subject->subject->subject_type_id ?? 0;
            });