app/Http/Livewire/Exam10ExamMarksEntryComp.php

select * from `exam05_details` where `exam05_details`.`id` in (189, 190, 191, 192, 193, 194, 195, 196, 197, 198)
---
    public function getExamPartsForClass($classId)
    {
        $cacheKey = "exam_parts_{$classId}";
        if ($this->selectedExamNameId) $cacheKey .= "_exam_{$this->selectedExamNameId}";
        if ($this->selectedExamTypeId) $cacheKey .= "_type_{$this->selectedExamTypeId}";
        if ($this->selectedSubjectId && $this->selectedSubjectId !== 'all') $cacheKey .= "_subject_{$this->selectedSubjectId}";

        return Cache::remember($cacheKey, 1800, function() use ($classId) {
            $query = Exam05Detail::where('myclass_id', $classId)
                ->with(['examName', 'examType', 'examPart', 'examMode']);

            if ($this->selectedExamNameId) {
                $query->where('exam_name_id', $this->selectedExamNameId);