app/Http/Livewire/Exam05ExamDetailComp.php

    public function render()
    {
        $groupedData = $this->getGroupedExamData();

        return view('livewire.exam05-exam-detail-comp', [
            'groupedData' => $groupedData,
            'sessions' => Session::all(),
            'examNames' => Exam01Name::all(),
            'classes' => Myclass::all(),
            'parts' => Exam03Part::all(),
            'types' => Exam02Type::all(),
            'modes' => Exam04Mode::all(),
            'schools' => School::all(),
            'users' => User::all()
---
select * from `exam01_names`
select * from `myclasses`
select * from `exam03_parts`
select * from `exam02_types`
select * from `exam04_modes`
select * from `schools`
select * from `users`

    public function getGroupedExamData()
    {
        $query = Exam05Detail::with(['examName', 'myclass', 'examPart', 'examType', 'examMode', 'session']);

        // Apply filters
        if ($this->selectedSession) {
            $query->where('session_id', $this->selectedSession);
        }

        if ($this->selectedExamName) {
            $query->where('exam_name_id', $this->selectedExamName);
        }

        if ($this->search) {
            $query->where(function($q) {
                $q->where('name', 'like', '%' . $this->search . '%')
                  ->orWhere('description', 'like', '%' . $this->search . '%');
            });
        }

        // Get all exam details
        $examDetails = $query->get();

        // Group by class first, then by exam_name, then by exam_type
        $grouped = collect();

        // Initialize structure with all classes and exam_names
        $classes = Myclass::all();
        $examNames = Exam01Name::all();
---
select * from `exam05_details`
select * from `myclasses` where `myclasses`.`id` in (1, 2)
select * from `myclasses`
select * from `exam01_names`

                $examTypeIds = $examDetails->where('exam_name_id', $examName->id)->pluck('exam_type_id')->unique();

                foreach ($examTypeIds as $examTypeId) {
                    $examType = Exam02Type::find($examTypeId); // Get the exam type object
---
select * from `exam02_types` where `exam02_types`.`id` = 1 limit 1

    public function buildMatrix()
    {
        $all = Exam05Detail::all();
---
select * from `exam05_details`