app/Http/Livewire/Exam07AnscrDistributionComp.php

select * from `sections` where `sections`.`id` in (1)
---
    public function initializeFormData()
    {
        // Initialize form data structure and load existing records
        $existingRecords = Exam07AnsscrDist::with([
            'myclassSection',
            'examClassSubject',
            'teacher'
        ])->get();

select * from `subject_types` where `name` = 'Summative' limit 1
select * from `myclass_subjects` where `myclass_id` = 1 and exists (select * from `subjects` where `myclass_subjects`.`subject_id` = `subjects`.`id` and `subject_type_id` = 2) order by `subject_id` asc
select * from `myclasses` where `myclasses`.`id` in (1)
select * from `subjects` where `subjects`.`id` in (1, 6, 9, 13, 24)
---
    public function getSummativeSubjects($classId)
    {
        // Get Summative subject type (assuming ID 2 based on database)
        $summativeType = SubjectType::where('name', 'Summative')->first();

        if (!$summativeType) {
            return collect();
        }

        return MyclassSubject::where('myclass_id', $classId)
            ->whereHas('subject', function($query) use ($summativeType) {
                $query->where('subject_type_id', $summativeType->id);
            })
            ->with(['subject', 'myclass'])
            ->orderBy('subject_id')
            ->get();

select * from `exam05_details` where `myclass_id` = 1 order by `exam_name_id` asc, `exam_type_id` asc, `exam_part_id` asc
---
    public function getExamDetailsForClass($classId)
    {
        return Exam05Detail::where('myclass_id', $classId)
            ->with(['examName', 'examType', 'examPart', 'examMode'])
            ->orderBy('exam_name_id')
            ->orderBy('exam_type_id')
            ->orderBy('exam_part_id')
            ->get()
            ->groupBy('exam_name_id');

select * from `exam07_ansscr_dists`
insert into `exam07_ansscr_dists` (`myclass_section_id`, `exam_class_subject_id`, `teacher_id`, `order_index`, `is_optional`, `session_id`, `school_id`, `user_id`, `approved_by`, `is_active`, `is_finalized`, `status`, `remarks`, `updated_at`, `created_at`) values (1, 742, '6', 0, 0, '', '', '', '', 1, 0, 'active', '', '2026-02-02 03:48:09', '2026-02-02 03:48:09')
---
    public function saveDistribution($myclassSectionId, $examDetailId)
    {
        $key = $myclassSectionId . '_' . $examDetailId;
        $data = $this->formData[$key] ?? [];

        // Validate required fields
        if (empty($data['teacher_id'])) {
            session()->flash('error', 'Teacher selection is required.');
            return;
        }

        $record = Exam07AnsscrDist::updateOrCreate(
            [
                'myclass_section_id' => $myclassSectionId,
                'exam_detail_id' => $examDetailId
            ],
            [
                'teacher_id' => $data['teacher_id'],
                'order_index' => $data['order_index'] ?? 0,
                'is_optional' => $data['is_optional'] ?? false,
                'session_id' => $data['session_id'] ?? null,
                'school_id' => $data['school_id'] ?? null,
                'user_id' => $data['user_id'] ?? null,
                'approved_by' => $data['approved_by'] ?? null,
                'is_active' => $data['is_active'] ?? true,
                'is_finalized' => $data['is_finalized'] ?? false,
                'status' => $data['status'] ?? 'active',
                'remarks' => $data['remarks'] ?? ''
            ]
        );