app/Http/Livewire/Exam10ExamMarksEntryComp.php

    public function loadData()
    {
        $this->classes = Myclass::orderBy('id')->get();
        $this->sections = MyclassSection::with(['section', 'myclass'])->orderBy('myclass_id')->get();
        $this->subjectTypes = SubjectType::orderBy('name')->get();
        $this->examNames = Exam01Name::orderBy('id')->get();
        $this->examTypes = Exam02Type::orderBy('name')->get();
        $this->examParts = Exam03Part::orderBy('name')->get();
        $this->sessions = Session::orderBy('name')->get();
        $this->schools = School::orderBy('name')->get();
        $this->users = User::orderBy('name')->get();

        // Load existing exam marks entries
        $this->examClassSubjects = Exam06ClassSubject::with([
            'myclass',
            'subject',
            'examDetail'
        ])->get();

        // Load existing marks entries
        $this->existingEntries = Exam10MarksEntry::with([
            'myclassSection.section',
            'examClassSubject.subject',
            'studentcr.studentdb',
            'session'
        ])->get();
---
select * from `myclasses` order by `id` asc
select * from `myclass_sections` order by `myclass_id` asc
select * from `myclasses` where `myclasses`.`id` in (1, 2, 3, 4, 5, 6, 7, 8)
select * from `sections` where `sections`.`id` in (1, 2)
select * from `subject_types` order by `name` asc
select * from `exam01_names` order by `id` asc
select * from `exam02_types` order by `name` asc
select * from `exam03_parts` order by `name` asc
select * from `schools` order by `name` asc
select * from `users` order by `name` asc
select * from `exam06_class_subjects`
select * from `myclasses` where `myclasses`.`id` in (1)
select * from `subjects` where `subjects`.`id` in (1, 6, 9, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24)
select * from `exam06_class_subjects` where `exam06_class_subjects`.`id` in (737, 742, 744, 747, 751, 752, 760, 761)
select * from `exam10_marks_entries`
select * from `myclass_sections` where `myclass_sections`.`id` in (1)
select * from `sections` where `sections`.`id` in (1)

    public function initializeFormData()
    {
        // Initialize form data structure and load existing records
        $existingRecords = Exam10MarksEntry::with([
            'myclassSection',
            'examClassSubject',
            'studentcr'
        ])->get();
---
select * from `exam06_class_subjects` where `exam06_class_subjects`.`id` in (737, 742, 744, 747, 751, 752, 760, 761)
select * from `exam10_marks_entries`
select * from `myclass_sections` where `myclass_sections`.`id` in (1)
select * from `studentcrs` where `studentcrs`.`id` in (21, 22, 23, 24)

    public function getClassSections($classId)
    {
        return MyclassSection::where('myclass_id', $classId)
            ->with(['section'])
            ->orderBy('section_id')
            ->get();
---
select * from `myclass_sections` where `myclass_id` = 1 order by `section_id` asc
select * from `sections` where `sections`.`id` in (1)

    public function getStudentsInSection($myclassSectionId)
    {
        // First get the MyclassSection record to get myclass_id and section_id
        $myclassSection = MyclassSection::find($myclassSectionId);

        if (!$myclassSection) {
            return collect();
        }

        // Query students using the separate myclass_id and section_id columns
        return \App\Models\Studentcr::where('myclass_id', $myclassSection->myclass_id)
            ->where('section_id', $myclassSection->section_id)
            ->with(['studentdb', 'myclass', 'section'])
            ->orderBy('roll_no')
            ->get();
---
select * from `myclass_sections` where `myclass_sections`.`id` = 1 limit 1
select * from `myclasses` where `myclasses`.`id` in (1)
select * from `sections` where `sections`.`id` in (1)
select * from `studentcrs` where `myclass_id` = 1 and `section_id` = 1 order by `roll_no` asc
select * from `studentdbs` where `studentdbs`.`id` in (21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 80, 166, 167, 168, 170, 189)

    public function getExamPartsForClass($classId)
    {
        $query = Exam05Detail::where('myclass_id', $classId)
            ->with(['examName', 'examType', 'examPart', 'examMode']);

        if ($this->selectedExamNameId) {
            $query->where('exam_name_id', $this->selectedExamNameId);
        }

        if ($this->selectedExamTypeId) {
            $query->where('exam_type_id', $this->selectedExamTypeId);
        }

        if ($this->selectedSubjectId && $this->selectedSubjectId !== 'all') {
            // Find exam details that have this subject mapped
            $examDetailIds = Exam06ClassSubject::where('myclass_id', $classId)
                ->where('subject_id', $this->selectedSubjectId)
                ->pluck('exam_detail_id');

            $query->whereIn('id', $examDetailIds);
        }

        return $query->orderBy('exam_part_id')->get();
---
select * from `exam05_details` where `myclass_id` = 1 order by `exam_part_id` asc

    public function getUniqueExamClassSubjectsForClass($classId)
    {
        $query = Exam06ClassSubject::where('myclass_id', $classId)
            ->with(['myclass', 'subject', 'examDetail.examName', 'examDetail.examType', 'examDetail.examPart']);

        if ($this->selectedExamNameId) {
            $query->whereHas('examDetail', function ($q) {
                $q->where('exam_name_id', $this->selectedExamNameId);
            });
        }

        if ($this->selectedExamTypeId) {
            $query->whereHas('examDetail', function ($q) {
                $q->where('exam_type_id', $this->selectedExamTypeId);
            });
        }

        if ($this->selectedSubjectId && $this->selectedSubjectId !== 'all') {
            $query->where('subject_id', $this->selectedSubjectId);
        }

        // Get unique subjects by grouping them
        $subjects = $query->get()->unique('subject_id')->values();
---
select * from `exam06_class_subjects` where `myclass_id` = 1
select * from `myclasses` where `myclasses`.`id` in (1)
select * from `subjects` where `subjects`.`id` in (1, 6, 9, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24)