app/Http/Livewire/SubadminDcProfileComp.php

    public function mount()
    {
        // Get authenticated user with relationships
        $this->user = User::with(['role', 'teacher'])
            ->find(auth()->id());

        // Get teacher information if user has teacher_id
        if ($this->user->teacher_id) {
            $this->teacher = Teacher::with(['subject', 'session', 'school'])
                ->find($this->user->teacher_id);
---
select * from `roles` where `roles`.`id` in (2)
select * from `teachers` where `teachers`.`id` in (10) and `id` > 5
select * from `users` where `users`.`id` = 7 limit 1
select * from `schools` where `schools`.`id` in (1)
select * from `subjects` where `subjects`.`id` in (25)
select * from `teachers` where `teachers`.`id` = 10 and `id` > 5 limit 1