app/Http/Livewire/SupadminDCUsersComp.php

select * from `roles` where `id` < 4
select * from `teachers` where `id` > 5 and `id` > 5
select * from `studentdbs`
---
    public function mount()
    {
        $this->roles = Role::where('id', '<', auth()->user()->role_id)->get();
        $this->teachers = Teacher::where('id', '>', 5)->get();
        $this->students = Studentdb::all();

select * from `roles` where `roles`.`id` in (1, 2, 3, 4, 5)
select * from `studentdbs` where `studentdbs`.`id` in (0)
select * from `teachers` where `teachers`.`id` in (0, 1, 3, 4, 5, 10) and `id` > 5
select * from `users` order by `id` desc, `created_at` desc limit 10 offset 0
---
    public function getUsers()
    {
        $query = User::with(['role', 'teacher', 'studentdb'])->orderBy('id', 'desc');

        if (!empty($this->search)) {
            $query->where(function($q) {
                $q->where('name', 'like', '%' . $this->search . '%')
                  ->orWhere('email', 'like', '%' . $this->search . '%');
            });
        }

        return $query->latest()->paginate(10);

select * from `users` where `users`.`id` = 6 limit 1
update `users` set `password` = '$2y$10$SI21Xg3CjlRot/USqG7EOu2F1Qz9UWdTVRewAT7lHZvk6zyiza37G', `teacher_id` = '12', `users`.`updated_at` = '2026-02-02 02:14:35' where `id` = 6
---
        }

        if ($this->user_id) {
            $user = User::find($this->user_id);
            $user->update($userData);

select * from `users` where `users`.`id` = 7 limit 1
---
    public function edit($id)
    {
        $user = User::findOrFail($id);